fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ПериодДляУказанияМесяца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоровИСсылок</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаЕжемесячнойАбоненсткойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
&НаСервере
Процедура ФормироватьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК ДоговорСсылка,
		|	ДоговорыКонтрагентов.Организация КАК Организация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент
		|ПОМЕСТИТЬ ВТ_Договор
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &АбонентскоеОбслуживание
		|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &КонецПериода
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &НачалоПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка,
		|	РеализацияТоваровУслуг.Договор.Ссылка КАК ДоговорСсылка
		|ПОМЕСТИТЬ ВТ_Реализация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Договор.ВидДоговора = &АбонентскоеОбслуживание
		|	И РеализацияТоваровУслуг.Дата >= &НачалоПериода
		|	И РеализацияТоваровУслуг.Дата <= &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Дата КАК Дата,
		|	ВТ_Договор.ДоговорСсылка КАК Договор,
		|	ВТ_Реализация.РеализацияСсылка КАК РеализацияСсылка,
		|	ВТ_Договор.Организация КАК Организация,
		|	ВТ_Договор.Контрагент КАК Контрагент
		|ИЗ
		|	ВТ_Договор КАК ВТ_Договор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализация КАК ВТ_Реализация
		|		ПО ВТ_Договор.ДоговорСсылка = ВТ_Реализация.ДоговорСсылка";
	ПериодДляУказанияМесяца = Объект.ПериодДляУказанияМесяца; 
	Запрос.УстановитьПараметр("Дата", ПериодДляУказанияМесяца);
	Запрос.УстановитьПараметр("АбонентскоеОбслуживание", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодДляУказанияМесяца)); 
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодДляУказанияМесяца)); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокДоговоровИСсылок = Объект.СписокДоговоровИСсылок;
	Пока Выборка.Следующий() Цикл
		Если Выборка.РеализацияСсылка = null Тогда
			Договор = Выборка.Договор;
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
    		ЗаполнитьЗначенияСвойств(ДокументОбъект, Выборка);
			ДокументОбъект.Записать();
			РеализацияСсылка = ДокументОбъект.Ссылка;  
			Если ДокументОбъект.ВыполнитьАвтозаполнение() Тогда 
				НоваяСтрока = СписокДоговоровИСсылок.Добавить(); 
				НоваяСтрока.Договор = Договор; 			
				НоваяСтрока.Реализация = РеализацияСсылка;
				Если ДокументОбъект.ПроверитьЗаполнение() Тогда
					РеализацияСсылка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;													 			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Новая запись с услугами в РеализацияТоваровУслуг от %1", ПериодДляУказанияМесяца);
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Формировать(Команда)
	ФормироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДляУказанияМесяцаПриИзменении(Элемент)
//	потому что не работает формат ДФ='MMММ yyyy' 	
	Месяцы = Новый Массив(12);
    Месяцы[0] = "январь";
    Месяцы[1] = "февраль";
    Месяцы[2] = "март";
    Месяцы[3] = "апрель";
    Месяцы[4] = "май";
    Месяцы[5] = "июнь";
    Месяцы[6] = "июль";
    Месяцы[7] = "август";
    Месяцы[8] = "сентябрь";
    Месяцы[9] = "октябрь";
    Месяцы[10] = "ноябрь";
    Месяцы[11] = "декабрь";
	Элементы.ПериодДляУказанияМесяца.ФорматРедактирования = СтрШаблон("ДФ='''%1'' yyyy'", Месяцы[Месяц(Объект.ПериодДляУказанияМесяца) - 1]);

КонецПроцедуры
